## Import libraries

In [3]:
import pandas as pd
import numpy as np
import os

## Import Data

In [5]:
path=r'/Users/yasersouri/Desktop/data analysis/immersion 6/World University Rankings - 2021'

In [6]:
df_ranking=pd.read_csv(os.path.join(path,'universities_ranking.csv'),index_col=False)

In [7]:
df_scores=pd.read_csv(os.path.join(path,'universities_scores.csv'),index_col=False)

## Data Consistency Checks df_ranking

In [9]:
df_ranking.dtypes

ranking                   int64
title                    object
location                 object
number students          object
students staff ratio    float64
perc intl students       object
gender ratio             object
dtype: object

In [10]:
# change data type
df_ranking['perc intl students'] = df_ranking['perc intl students'].str.replace('%', '', regex=False).replace('', '0').astype(float) / 100
df_ranking['ranking']=df_ranking['ranking'].astype('str')

In [11]:
df_ranking.dtypes

ranking                  object
title                    object
location                 object
number students          object
students staff ratio    float64
perc intl students      float64
gender ratio             object
dtype: object

In [12]:
#function for checking whether a dataframe contains any mixed-type columns
for col in df_ranking.columns.tolist():
  weird = (df_ranking[[col]].map(type) != df_ranking[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ranking[weird]) > 0:
    print (col)

gender ratio

In [13]:
# delete gender ratio column & students staff ratio ; because it is unspecified
df_ranking = df_ranking.drop(columns=['gender ratio'])
df_ranking = df_ranking.drop(columns=['students staff ratio'])

In [14]:
# change column names
df_ranking.rename(columns={'number students': 'number_of_students'}, inplace=True)
df_ranking.rename(columns={'perc intl students': 'international_students%'}, inplace=True)

In [15]:
# df_ranking statistical analysis
df_ranking.describe()

       international_students%
count              1526.000000
mean                  0.113073
std                   0.119854
min                   0.000000
25%                   0.020000
50%                   0.070000
75%                   0.170000
max                   0.840000

##  Missing Data df_ranking

In [17]:
#find missing data
df_ranking.isnull().sum()

ranking                    0
title                      0
location                   0
number_of_students         0
international_students%    0
dtype: int64

no missing data

## Duplicates df_ranking

In [20]:
#find duplicates
df_dup=df_ranking[df_ranking.duplicated()]
df_dup

Empty DataFrame
Columns: [ranking, title, location, number_of_students, international_students%]
Index: []

no duplicates

## df_ranking

In [23]:
df_ranking.head()

,ranking,title,location,number_of_students,international_students%
0,1,University of Oxford,United Kingdom,"20,774",0.41
1,2,Stanford University,United States,"16,223",0.23
2,3,Harvard University,United States,"21,261",0.25
3,4,California Institute of Technology,United States,"2,238",0.33
4,5,Massachusetts Institute of Technology,United States,"11,276",0.34

In [24]:
df_ranking.shape

(1526, 5)

## Data Consistency Checks df_scores

In [26]:
df_scores.dtypes

ranking                    int64
title                     object
location                  object
overall score            float64
teaching score           float64
research score           float64
citations score          float64
industry income score    float64
intl outlook score       float64
Unnamed: 9               float64
Unnamed: 10              float64
Unnamed: 11              float64
Unnamed: 12              float64
dtype: object

In [27]:
# change data type
df_scores['ranking']=df_scores['ranking'].astype('str')
df_scores['overall score']=df_scores['overall score'].astype('float64')

In [28]:
df_scores.dtypes

ranking                   object
title                     object
location                  object
overall score            float64
teaching score           float64
research score           float64
citations score          float64
industry income score    float64
intl outlook score       float64
Unnamed: 9               float64
Unnamed: 10              float64
Unnamed: 11              float64
Unnamed: 12              float64
dtype: object

In [29]:
#function for checking whether a dataframe contains any mixed-type columns
for col in df_scores.columns.tolist():
  weird2= (df_scores[[col]].map(type) != df_scores[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_scores[weird2]) > 0:
    print (col)

no mixed-type data

In [31]:
# change column names
df_scores.rename(columns={'overall score': 'overall_score'}, inplace=True)
df_scores.rename(columns={'teaching score': 'teaching_score'}, inplace=True)
df_scores.rename(columns={'research score': 'research_score'}, inplace=True)
df_scores.rename(columns={'citations score': 'citations_score'}, inplace=True)
df_scores.rename(columns={'industry income score': 'industry_income_score'}, inplace=True)
df_scores.rename(columns={'intl outlook score': 'international_outlook_score'}, inplace=True)

In [32]:
# df_scores statistical analysis
df_scores.describe()

,overall_score,teaching_score,research_score,citations_score,industry_income_score,international_outlook_score,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
count,1526.000000,1526.000000,1526.000000,1526.000000,1526.000000,1526.000000,0.0,0.0,0.0,0.0
mean,34.473591,27.811337,23.573001,48.127392,46.090826,47.029292,NaN,NaN,NaN,NaN
std,16.822791,13.622781,17.333799,27.609148,17.151123,23.168845,NaN,NaN,NaN,NaN
min,11.000000,11.700000,7.100000,1.900000,33.300000,13.500000,NaN,NaN,NaN,NaN
25%,21.000000,18.600000,11.400000,23.500000,34.800000,27.500000,NaN,NaN,NaN,NaN
50%,32.000000,23.550000,17.500000,45.100000,38.500000,42.300000,NaN,NaN,NaN,NaN
75%,44.000000,32.500000,29.975000,71.300000,50.000000,63.000000,NaN,NaN,NaN,NaN
max,95.600000,94.400000,99.600000,100.000000,100.000000,100.000000,NaN,NaN,NaN,NaN

## Missing Data df_scores

In [34]:
#find missing data
df_scores.isnull().sum()

ranking                           0
title                             0
location                          0
overall_score                     0
teaching_score                    0
research_score                    0
citations_score                   0
industry_income_score             0
international_outlook_score       0
Unnamed: 9                     1526
Unnamed: 10                    1526
Unnamed: 11                    1526
Unnamed: 12                    1526
dtype: int64

no missing data

## Duplicates df_scores

In [37]:
#find duplicates
df_dup2=df_scores[df_scores.duplicated()]
df_dup2

Empty DataFrame
Columns: [ranking, title, location, overall_score, teaching_score, research_score, citations_score, industry_income_score, international_outlook_score, Unnamed: 9, Unnamed: 10, Unnamed: 11, Unnamed: 12]
Index: []

no duplicates

## df_scores

In [40]:
df_scores.head()

,ranking,title,location,overall_score,teaching_score,research_score,citations_score,industry_income_score,international_outlook_score,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,1,University of Oxford,United Kingdom,95.6,91.3,99.6,98.0,68.7,96.4,NaN,NaN,NaN,NaN
1,2,Stanford University,United States,94.9,92.2,96.7,99.9,90.1,79.5,NaN,NaN,NaN,NaN
2,3,Harvard University,United States,94.8,94.4,98.8,99.4,46.8,77.7,NaN,NaN,NaN,NaN
3,4,California Institute of Technology,United States,94.5,92.5,96.9,97.0,92.7,83.6,NaN,NaN,NaN,NaN
4,5,Massachusetts Institute of Technology,United States,94.4,90.7,94.4,99.7,90.4,90.0,NaN,NaN,NaN,NaN

In [41]:
df_scores.shape

(1526, 13)

## Combine Dataframes

In [43]:
# merging df_ranking and df_ords_scores dataframes
df_merged=df_ranking.merge(df_scores,on=['ranking','title','location'])

In [44]:
df_merged.head()

,ranking,title,location,number_of_students,international_students%,overall_score,teaching_score,research_score,citations_score,industry_income_score,international_outlook_score,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,1,University of Oxford,United Kingdom,"20,774",0.41,95.6,91.3,99.6,98.0,68.7,96.4,NaN,NaN,NaN,NaN
1,2,Stanford University,United States,"16,223",0.23,94.9,92.2,96.7,99.9,90.1,79.5,NaN,NaN,NaN,NaN
2,3,Harvard University,United States,"21,261",0.25,94.8,94.4,98.8,99.4,46.8,77.7,NaN,NaN,NaN,NaN
3,4,California Institute of Technology,United States,"2,238",0.33,94.5,92.5,96.9,97.0,92.7,83.6,NaN,NaN,NaN,NaN
4,5,Massachusetts Institute of Technology,United States,"11,276",0.34,94.4,90.7,94.4,99.7,90.4,90.0,NaN,NaN,NaN,NaN

In [45]:
df_merged.shape

(1526, 15)

In [46]:
# df_merged statistical analysis
df_merged.describe()

,international_students%,overall_score,teaching_score,research_score,citations_score,industry_income_score,international_outlook_score,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
count,1526.000000,1526.000000,1526.000000,1526.000000,1526.000000,1526.000000,1526.000000,0.0,0.0,0.0,0.0
mean,0.113073,34.473591,27.811337,23.573001,48.127392,46.090826,47.029292,NaN,NaN,NaN,NaN
std,0.119854,16.822791,13.622781,17.333799,27.609148,17.151123,23.168845,NaN,NaN,NaN,NaN
min,0.000000,11.000000,11.700000,7.100000,1.900000,33.300000,13.500000,NaN,NaN,NaN,NaN
25%,0.020000,21.000000,18.600000,11.400000,23.500000,34.800000,27.500000,NaN,NaN,NaN,NaN
50%,0.070000,32.000000,23.550000,17.500000,45.100000,38.500000,42.300000,NaN,NaN,NaN,NaN
75%,0.170000,44.000000,32.500000,29.975000,71.300000,50.000000,63.000000,NaN,NaN,NaN,NaN
max,0.840000,95.600000,94.400000,99.600000,100.000000,100.000000,100.000000,NaN,NaN,NaN,NaN

## Export Data

In [48]:
df_merged.to_csv(os.path.join(path,'clean_df.csv'))